const textReferenceInformation = {
  "Телефон, пошта": [
    "Телефон — (050) 237-90-00",
    "Вайбер — (050) 237-90-00",
    "Пошта — vd.profi.tools@gmail.com",
    "Сайт — www.vdprofitools.com"],

  "Навігація по сайту": [
    "На сайті присутні 9 основних розділів для замовлення продукції: «Пускові дроти», «Дроти для ПЗП», «Зварювальні дроти», «Подовжувачі зварні», «Крокодили та клеми», «Перемички для АКБ», «Шина мідна плетена», «Тверда шина», «Дроти для 220В». Всі основні розділи мають можливість сортування товарів за ціною та багато фільтрів для відокремлення товарів з вибраними характеристиками. Це обмежує кількість одночасно відображених товарів і дозволяє швидко зробити вибір.",
    "Ви можете помістити товари безпосередньо у «Кошик» для подальшого оформлення покупки. Якщо є сумніви, то варто помістити товар у «Список бажань». На фінішному етапі оформлення є можливість переміщати товари між «Кошиком» та «Списком бажань» для формування остаточного переліку.", "Розділ «Онлайн розрахунів» дозволяє зробити швидків прорахунки технічних параметрів продукції.",
    "Розділ «Контакти» містить, окрім контактної інформації, також вімомости щодо термінів виготовлення продукції, гарантиійних зобов'язань, умов користування сайтом, політики конфіденційності та згоду на обробку персональних даних."],

  "Терміни виготовлення": [
    "Частина продукції представленої на сайті вже готова для відвантаження. Для такої продукції стоїть термін виготовлення «готово». Інша продукція виготовляється під замовлення з попередніми термінами готовності: «1 робочий день», «2 робочих дні» чи «4 робочих дні». В будь-якому випадку всі терміни виготовлення на продукцію узгоджуються з замовником на етапі узгодження замовлення.",
    "Якщо зазначені терміни виготовлення вас не влаштовують, ви можете замовити продукцію і акцентувати в коментарі до замовлення бажані терміни виготовлення. Можливо саме ваше замовлення буде можливість зробити скоріше зазначених термінів виготовлення."],

  "Гарантійні зобов'язання": [
    "Стандартні гарантійні зобов'язання на виготовлену продукцію один рік. Гарантія розповсюджується на самі «крокодили», штекери (байонети), наконечники та місця їх фіксації з кабелем. При відсутності суто механічних експлуатаційних пошкоджень цих елементів - заміна чи ремонт виконуються безкоштовно (тільки пересилка за рахунок покупця). Гарантія не розповсюджується на механічні пошкодження кабеля."],

  "Оформлення покупки": [
    "Для оформлення покупки вам потрібно перейти в розділ «Кошик». В ньому є вже вибраний вами товар з різних розділів сайту - «Товар у кошику». Також є товар у «Списку вподобань». Ви можете перміщати товар з одного списку в інший для корегування загального переліку і вартості замовлення. Після формування остаточного переліку товара для замовлення у кошику - потрібно натиснути на кнопку «Оформити замовлення», заповнити контактні дані та відправити замовлення у опрацювання."],

  "Згода на обробку персональних даних": [
    "Згода на обробку персональних даних",
    "Я, Користувач сайту https://viktornik.github.io/JSW/ (далі «Сайту»), суб'єкт персональних даних, відповідно до вказаної мною інформації на Сайті, керуючись Законом України «Про захист персональних даних», надаю дозвіл на обробку моїх персональних даних (відомостей та сукупності відомостей про мене) власнику Сайту та виробнику продукції представленої на Сайті (далі Виробнику) на наступних умовах:",
    "1. Скориставшись сервісами Сайту, Користувач надає свою згоду Виробнику на обробку своїх персональних даних, Користувач дозволяє здійснення будь - яких дій в інформаційній(автоматизованій) системі та / або картотеці персональних даних, пов’язаних зі збором, реєстрацією, накопиченням, зберіганням на необмежений термін, адаптацією, зміною, поновленням, використанням і поширенням, включаючи реалізацію і передачу, знеособленням, знищенням(разом – «обробкою») всіх переданих персональних даних з метою поширення інформації, пов’язаної з діяльністю Сайту.",
    "2. Скориставшись сервісами Сайту, Користувач підтверджує відсутність будь - яких застережень щодо обмеження права на обробку персональних даних, а також надає свою добровільну згоду на використання таких персональних даних на Сайті, наданню права обробки, доступу і розповсюдження будь - яким третім особам в вищевказаних цілях на необмежений термін без повідомлення Користувача про таку передачу персональних даних.",
    "3. Сайт та / або Виробник може здійснювати обробку персональних даних Користувача в письмовій(паперовій), електронній та іншій формі, включаючи, але не обмежуючись наступними персональними даними: ім’я та прізвище Користувача, адреса електронної пошти Користувача, телефон Користувача, регіон проживання та / або інша контактна інформація, вказана Користувачем у відкритому доступі, повідомлення, листи, відгуки та інші текстові дані, адресовані / передані Користувачу іншими Користувачами і навпаки.",
    "4. Персональні дані Користувача Сайту обробляються Сайтом та / або Виробником з метою: забезпечення своєчасного і якісного контакту з Користувачем, інформування Користувачів з приводу умов надання послуг, змін в сервісах та організації Сайту, а також для інших цілей, що не суперечать чинному законодавству.",
    "5. Відповідно до вимог чинного законодавства України Виконавець може розкривати Персональні дані Користувачів третім особам в цілях, пов’язаних з їх законними правами і повноваженнями, у тому числі державним органам та установам, при дотриманні встановленого порядку надання таких даних.",
    "6. Персональні дані Користувачів Сайту, зберігаються протягом усього терміну діяльності Сайту.",
    "7. Якщо Користувач не згоден із зазначеними вище умовами, то не повинен використовувати Сайт.",
    "Поставивши галочку навпроти «Даю згоду на обробку персональних даних» ви погоджуєтеся із зазначеним вище умовами та надаєте свою чітку та добровільну згоду на обробку Персональних даних, а також підтверджуєте, що ви належним чином поінформовані про власника Персональних даних, склад та обсяг зібраних Персональних даних, ваші права як суб'єкта персональних даних, що передбачені Законом України «Про захист персональних даних», цілі збору Персональних даних та осіб, яким можуть бути передані ваші Персональні дані.",],

  "Політика конфіденційності<br>та умови<br>використання сайту": [
    "Політика конфіденційності та умови використання сайту",
    "1. Для зберігання даних Користувача а також його ідентифікації Сайт використовує кукіси(cookies) а також схожі технології зберігання та ідентифікації.Перш за все це дозволяє надавати користувачам максимальні зручності в користуванні сайтом.",
    "2. При використанні Сайту, Користувач підтверджує свою згоду на використання файлів cookies, IP - адрес та схожих технологій ідентифікації.",
    "3. Якщо Користувач не згоден з тим, щоб Сайт використовував вищенаведені технології ідентифікації та / або збору даних – Користувач повинен відповідним чином встановити налаштування свого браузера або не використовувати Сайт.",
    "Поставивши галочку навпроти «Погоджуюся з політикою конфіденційності та умовами використання сайту» ви погоджуєтеся із зазначеним вище умовами та надаєте свою чітку та добровільну згоду на використання Сайту.",],
};

export const getReferenceInformationProduct_10 = (headerSubMenu) => {
  const nodeTextHTML = [];
  nodeTextHTML.push("<div class='div-information-product'>");
  // формуємо опис продукту
  textReferenceInformation[headerSubMenu].forEach(paragraph => {
    nodeTextHTML.push(`<p class='paragraph-information'>${paragraph}</p>`);
  });
  nodeTextHTML.push("</div>");
  return nodeTextHTML;
}
