const textReferenceInformation = {
  "Контакти": [
    "Телефон — (050) 237-90-00",
    "Вайбер — (050) 237-90-00",    
    "Пошта — vd.profi.tools@gmail.com",
    "Сайт — www.vdprofitools.com",  
  ],
  
  "Навігація по сайту": [
    "На сайті присутні 9 основних розділів для замовлення продукції, розділ для попередніх онлайн розрахунів та розділ для оформлення замовлення.",
    "Кожен розділ для замовлення продукції: «Пускові дроти», «Дроти для ПЗП», «Зварювальні дроти», «Подовжувачі зварні», «Крокодили та клеми», «Перемички для АКБ», «Шина мідна плетена», «Тверда шина», «Дроти для 220В» містить можливість сортування за ціною вибрних товарів та багато фільтрів для відокремлення потрібних саме вам параметрів. Це обмежує кількість одночасно відображених товарів і дозволяє швидко вибрати товари з бажаними параметрами. Ви можете помістити товари безпосередньо у «Кошик», чи у «Список бажань», якщо сумніваєтесь. При оформленні замовлення буде можливість переглянити обидва списки і відкорегувати їх.",],

  "Терміни виготовлення":
    [
      "Частина продукції представленої на сайті вже готова для відвантаження. Для такої продукції стоїть термін виготовлення «готово». Інша продукція виготовляється під замовлення з попередніми термінами готовності: «1 робочий день», «2 робочих дні» чи «4 робочих дні». В будь-якому випадку всі терміни виготовлення на продукцію узгоджуються з замовником на етапі узгодження замовлення.",
      "Якщо зазначені терміни виготовлення вас не влаштовують, ви можете замовити продукцію і акцентувати в коментарі до замовлення бажані терміни виготовлення. Можливо саме ваше замовлення буде можливість зробити скоріше зазначених термінів виготовлення."],

  "Гарантійні зобов'язання": ["Стандартні гарантійні зобов'язання на виготовлену продукцію один рік. Гарантія розповсюджується на самі «крокодили», штекери (байонети), наконечники та місця їх фіксації з кабелем. При відсутності суто механічних експлуатаційних пошкоджень цих елементів - заміна чи ремонт виконуються безкоштовно (тільки пересилка за рахунок покупця). Гарантія не розповсюджується на механічні пошкодження кабеля."],

  "Оформлення покупки": ["Для оформлення покупки вам потрібно перейти в розділ «Кошик». В ньому є вже вибраний вами товар з різних розділів сайту - «Товар у кошику». Також є товар у «Списку вподобань». Ви можете перміщати товар з одного списку в інший для корегування загального переліку і вартості замовлення. Після формування остаточного переліку товара для замовлення у кошику - потрібно натиснути на кнопку «Оформити замовлення», заповнити контактні дані та відправити замовлення у опрацювання."]
};

export const getReferenceInformationProduct_10 = (headerSubMenu) => {
  const nodeTextHTML = [];
  nodeTextHTML.push("<div class='div-information-product'>");
  // формуємо опис продукту
  textReferenceInformation[headerSubMenu].forEach(paragraph => {
    nodeTextHTML.push(`<p class='paragraph-information'>${paragraph}</p>`);
  });
  nodeTextHTML.push("</div>");
  return nodeTextHTML;
}
